{
    "questions": [
        {
            "tag": "Info",
            "questions": [
                { "num": 1, "content": ["Bạn có thể cho biết tên đầy đủ của bạn không?"] },
                { "num": 2, "content": ["Bạn bao nhiêu tuổi?"] },
                { "num": 3, "content": ["Bạn có thể cho biết giới tính của mình không?"] },
                { "num": 4, "content": ["Bạn có thể cho số điện thoại hoặc email của bạn không?"] }
            ]
        },
        {
            "tag": "Symptoms",
            "questions": [
                { "num": 5, "content": ["Hiện tại bạn đang gặp phải những triệu chứng gì?", "Bạn có thể cho biết chi tiết các triệu chứng bạn gặp phải được không?"] },
                { "num": 6, "content": ["Các triệu chứng này bắt đầu từ khi nào?", "Các triệu chứng này kéo dài bao lâu rồi?"] },
                { "num": 7, "content": ["Cơn đau có lan ra hay di chuyển đến các bộ phận khác của cơ thể không?", "Điều gì khiến triệu chứng trở nên tốt hơn hay tệ hơn?"] },
                { "num": 8, "content": ["Các triệu chứng xuất hiện vào thời gian nào trong ngày hay liên tục?", "Tần suất các triệu chứng xuất hiện như thế nào"] }
            ]
        },
        {
            "tag": "Disease",
            "questions": [
                { "num": 9, "content": ["Bạn có mắc phải bệnh mãn tính nào như tiểu đường, cao huyết áp hay hen suyễn không?"] },
                { "num": 10, "content": ["Bạn đã từng phẫu thuật lần nào trước đây chưa?", "Bạn có thể liệt kê các lần phẫu thuật bạn đã trải qua không được không?"] },
                { "num": 11, "content": ["Hiện tại bạn có đang điều trị y tế nào không?", "Bạn có thể liệt kê các phương pháp điều trị đó được không?"] },
                { "num": 12, "content": ["Bạn đã từng được chẩn đoán với tình trạng tương tự chưa?", "Bạn có thể cho tôi biết chuẩn đoán đó không"] }
            ]
        },
        {
            "tag": "Medicine",
            "questions": [
                { "num": 13, "content": ["Hiện tại bạn có đang dùng thuốc hay thực phẩm bổ sung nào không?"] },
                { "num": 14, "content": ["Bạn có thể liệt kê các loại thuốc bạn đang dùng và liều lượng không?"] },
                { "num": 15, "content": ["Bạn có gặp phản ứng phụ nào từ thuốc đang dùng không?"] },
                { "num": 16, "content": ["Bạn có dị ứng với loại thuốc nào không?"] }
            ]
        },
        {
            "tag": "Inherited",
            "questions": [
                { "num": 17, "content": ["Gia đình bạn có ai mắc bệnh mạn tính như ung thư, bệnh tim hay tiểu đường không?"] },
                { "num": 18, "content": ["Lịch sử bệnh lý gia đình bạn về các bệnh di truyền như thế nào?"]},
                { "num": 19, "content": ["Trong gia đình có ai từng có triệu chứng tương tự không?"]}
            ]
        },
        {
            "tag": "LifeStyle",
            "questions": [
                { "num": 20, "content": ["Bạn có hút thuốc hay sử dụng sản phẩm từ thuốc lá không?", "Bạn uống rượu bia với tần suất như thế nào?"] },
                { "num": 21, "content": ["Bạn có bị sụt cân hay tăng cân gần đây không?"] },
                { "num": 22, "content": ["Bạn có khó thở hay đau ngực không?"] },
                { "num": 23, "content": ["Bạn có nhận thấy thay đổi nào trong thói quen đi tiêu hay tiểu tiện không?"] },
                { "num": 24, "content": ["Bạn có dị ứng với thực phẩm, thuốc hay yếu tố môi trường nào không?"] },
                { "num": 25, "content": ["Bạn đã từng gặp phản ứng như thế nào với các chất gây dị ứng?"] }
            ]
        },
        {
            "tag": "Additional",
            "questions": [                     
                { "num": 26, "content": ["Bạn có thể cung cấp hình ảnh các toa thuốc hoặc các tài liệu y tế của bạn không?", "Bạn có bất kỳ kết quả xét nghiệm nào gần đây mà bạn có thể chia sẻ không?"] }
            ]
        }
    ]
}
